# Вводимо ціну одного літра молока, тип float (дробове число)
a = float(input('Уведіть ціну 1 л молока: '))
# Вводимо ціну одного батона, тип float (дробове число)
b = float(input('Уведіть ціну 1 батона: '))
# Вводимо ціну порції морозива, тип float (дробове число)
c = float(input('Уведіть ціну 1 порції улюбленого морозива: '))
# Вводимо загальну суму грошей від мами, тип float (дробове число)
x = float(input('Уведіть суму грошей, яку дала мама: '))
d = 2 * a + b  # Розраховуємо загальну вартість покупки: 2 літри молока та 1 батон

if x - d >= c:  # Якщо решта грошей після покупки більша або дорівнює ціні морозива
    print('Так, вистачить')  # Виводимо, що грошей вистачить на морозиво
else:
    print('Ні, не вистачить')  # Виводимо, що грошей не вистачить на морозиво


# Вводимо значення змінної x, тип float (дробове число)
x = float(input('Уведіть значення x: '))

if x <= 2:  # Якщо x менше або дорівнює 2
    y = 2 * x - 3  # Розраховуємо y за формулою 2x - 3
else:  # Інакше (x більше за 2)
    y = 3 * x - 2  # Розраховуємо y за формулою 3x - 2

print('Значення змінної y: ', y)  # Виводимо обчислене значення y
